#данные по заданию
X = [0.0, 1.0, 2.0, 3.0, 4.0]
Y = [0.0, 1.0, 1.4142, 1.7321, 2.0]

X_ = 2.0

d_Y_1 = (Y[2]-Y[1])/(X[2] - X[1])
print("Вариант 5")
print(f"Левая первая производная:{d_Y_1}")

yd = (Y[3] - Y[2]) / (X[3] - X[2])
print("Правая первая производная:")
print(yd)

d_Y_2 = (Y[2]-Y[1])/(X[2] - X[1]) + ((Y[3] - Y[2])/(X[3]-X[2]) - (Y[2]-Y[1])/(X[2] -X[1]))*(2*X_-X[1]-X[2])/(X[3] -X[1])
print(f"Первая производная со вторым порядком точности:{d_Y_2}")

d_2_Y = 2*((Y[3] - Y[2])/(X[3]-X[2]) - (Y[2] - Y[1])/(X[2] - X[1]))/(X[3]- X[1])
print(f"Вторая производная:{d_2_Y}")
